Revit 2026 API

# RebarContainerParameterManagerAddOverride(ElementId, Double) Method

---

Adds an override for the given parameter as its value will be displayed for the Rebar Container element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddOverride(
	ElementId paramId,
	double value
)
```
```vb
Public Sub AddOverride (
	paramId As ElementId,
	value As Double
)
```
```cpp
public:
void AddOverride(
	ElementId^ paramId,
	double value
)
```
```fsharp
member AddOverride :
        paramId : ElementId *
        value : float -> unit
```

#### Parameters

paramId ElementId
     The id of the parameter
value Double
     The override value of the parameter.

| Exception | Condition |
| --- | --- |
| ArgumentException | paramId is not the id of a parameter in the current document, or its value type is not double. -or- paramId is not a Rebar Container parameter |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RebarContainerParameterManager Class

AddOverride Overload

Autodesk.Revit.DB.Structure Namespace